<a href="https://colab.research.google.com/github/Naomibn/2-LimpiezaDatos/blob/main/2_LimpiezaDeDatosFull.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **LIMPIEZA DE DATOS**

In [157]:
import pandas as pd
Location = "/content/drive/My Drive/Colab Notebooks/datasets/gradedata.csv"
df = pd.read_csv(Location)

meangrade = df['grade'].mean()
stdgrade = df['grade'].std()

toprange = meangrade + stdgrade * 1.96
botrange = meangrade - stdgrade * 1.96

copydf = df
copydf = copydf.drop(copydf[copydf['grade'] > toprange].index)
copydf = copydf.drop(copydf[copydf['grade'] < botrange].index)
copydf

          fname     lname  ...  grade                                      address
0        Marcia      Pugh  ...   82.4      9253 Richardson Road, Matawan, NJ 07747
1        Kadeem  Morrison  ...   78.2             33 Spring Dr., Taunton, MA 02780
2          Nash    Powell  ...   79.3             41 Hill Avenue, Mentor, OH 44060
3       Noelani    Wagner  ...   83.2           8839 Marshall St., Miami, FL 33125
4       Noelani    Cherry  ...   87.4     8304 Charles Rd., Lewis Center, OH 43035
...         ...       ...  ...    ...                                          ...
1995       Cody  Shepherd  ...   80.1        982 West Street, Alexandria, VA 22304
1996  Geraldine  Peterson  ...  100.0   78 Morris Street, East Northport, NY 11731
1997   Mercedes      Leon  ...   84.9        30 Glenridge Rd., Bountiful, UT 84010
1998     Lucius   Rowland  ...   69.1  342 West Meadowbrook Lane, Helena, MT 59601
1999      Linus    Morris  ...   79.6       81 Homestead Drive, Voorhees, NJ 08043

[1946 rows x 8 columns]

In [158]:
from google.colab import drive
drive.mount('/content/drive')

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

In [159]:
import pandas as pd

Location = "/content/drive/My Drive/Colab Notebooks/datasets/gradedata.csv"
df = pd.read_csv(Location)

q1 = df['grade'].quantile(.25)
q3 = df['grade'].quantile(.75)

iqr = q3-q1

toprange = q3 + iqr * 1.5
botrange = q1 - iqr * 1.5

copydf = df

copydf = copydf.drop(copydf[copydf['grade'] > toprange].index)
copydf = copydf.drop(copydf[copydf['grade'] < botrange].index)

copydf

          fname     lname  ...  grade                                      address
0        Marcia      Pugh  ...   82.4      9253 Richardson Road, Matawan, NJ 07747
1        Kadeem  Morrison  ...   78.2             33 Spring Dr., Taunton, MA 02780
2          Nash    Powell  ...   79.3             41 Hill Avenue, Mentor, OH 44060
3       Noelani    Wagner  ...   83.2           8839 Marshall St., Miami, FL 33125
4       Noelani    Cherry  ...   87.4     8304 Charles Rd., Lewis Center, OH 43035
...         ...       ...  ...    ...                                          ...
1995       Cody  Shepherd  ...   80.1        982 West Street, Alexandria, VA 22304
1996  Geraldine  Peterson  ...  100.0   78 Morris Street, East Northport, NY 11731
1997   Mercedes      Leon  ...   84.9        30 Glenridge Rd., Bountiful, UT 84010
1998     Lucius   Rowland  ...   69.1  342 West Meadowbrook Lane, Helena, MT 59601
1999      Linus    Morris  ...   79.6       81 Homestead Drive, Voorhees, NJ 08043

[1998 rows x 8 columns]

**TAREA:** Load the dataset datasets/outlierdata.csv. Can you remove the
outliers? Try it with both methods.

In [160]:
#Método 1
import pandas as pd
Location = "/content/drive/My Drive/Colab Notebooks/datasets/outlierdata.csv"
df = pd.read_csv(Location)

meangrade = df['Net Worth'].mean()
stdgrade = df['Net Worth'].std()

toprange = meangrade + stdgrade * 1.96
botrange = meangrade - stdgrade * 1.96

copydf = df
copydf = copydf.drop(copydf[copydf['Net Worth'] > toprange].index)
copydf = copydf.drop(copydf[copydf['Net Worth'] < botrange].index)
copydf

                  Name  Net Worth
0     Stella B. Battle      13853
1    Virginia Q. Salas      18065
2       Keiko S. Berry       6169
3    Dustin U. Hopkins       4857
4     Sloane O. Atkins      14022
..                 ...        ...
95   Barbara Z. Rivera      17272
96     Lilah Q. Porter      -9786
97    Angelica Z. King          3
98    Delilah N. Sweet        350
99  Valentine X. Henry       3099

[98 rows x 2 columns]

In [161]:
#Método 2
import pandas as pd

Location = "/content/drive/My Drive/Colab Notebooks/datasets/outlierdata.csv"
df = pd.read_csv(Location)

q1 = df['Net Worth'].quantile(.25)
q3 = df['Net Worth'].quantile(.75)

iqr = q3-q1

toprange = q3 + iqr * 1.5
botrange = q1 - iqr * 1.5

copydf = df

copydf = copydf.drop(copydf[copydf['Net Worth'] > toprange].index)
copydf = copydf.drop(copydf[copydf['Net Worth'] < botrange].index)

copydf

                  Name  Net Worth
0     Stella B. Battle      13853
1    Virginia Q. Salas      18065
2       Keiko S. Berry       6169
3    Dustin U. Hopkins       4857
4     Sloane O. Atkins      14022
..                 ...        ...
95   Barbara Z. Rivera      17272
96     Lilah Q. Porter      -9786
97    Angelica Z. King          3
98    Delilah N. Sweet        350
99  Valentine X. Henry       3099

[97 rows x 2 columns]

# **Datos extraviados**

In [162]:
import pandas as pd
df = pd.read_csv("/content/drive/My Drive/Colab Notebooks/datasets/gradedatamissing.csv")

df

          fname     lname  ...  grade                                      address
0        Marcia      Pugh  ...   82.4      9253 Richardson Road, Matawan, NJ 07747
1        Kadeem  Morrison  ...   78.2             33 Spring Dr., Taunton, MA 02780
2          Nash    Powell  ...   79.3             41 Hill Avenue, Mentor, OH 44060
3       Noelani    Wagner  ...   83.2           8839 Marshall St., Miami, FL 33125
4       Noelani    Cherry  ...   87.4     8304 Charles Rd., Lewis Center, OH 43035
...         ...       ...  ...    ...                                          ...
1997       Cody  Shepherd  ...   80.1        982 West Street, Alexandria, VA 22304
1998  Geraldine  Peterson  ...  100.0   78 Morris Street, East Northport, NY 11731
1999   Mercedes      Leon  ...   84.9        30 Glenridge Rd., Bountiful, UT 84010
2000     Lucius   Rowland  ...   69.1  342 West Meadowbrook Lane, Helena, MT 59601
2001      Linus    Morris  ...   79.6       81 Homestead Drive, Voorhees, NJ 08043

[2002 rows x 8 columns]

In [163]:
df_no_missing = df.dropna()
df_no_missing

          fname     lname  ...  grade                                      address
0        Marcia      Pugh  ...   82.4      9253 Richardson Road, Matawan, NJ 07747
1        Kadeem  Morrison  ...   78.2             33 Spring Dr., Taunton, MA 02780
2          Nash    Powell  ...   79.3             41 Hill Avenue, Mentor, OH 44060
3       Noelani    Wagner  ...   83.2           8839 Marshall St., Miami, FL 33125
4       Noelani    Cherry  ...   87.4     8304 Charles Rd., Lewis Center, OH 43035
...         ...       ...  ...    ...                                          ...
1997       Cody  Shepherd  ...   80.1        982 West Street, Alexandria, VA 22304
1998  Geraldine  Peterson  ...  100.0   78 Morris Street, East Northport, NY 11731
1999   Mercedes      Leon  ...   84.9        30 Glenridge Rd., Bountiful, UT 84010
2000     Lucius   Rowland  ...   69.1  342 West Meadowbrook Lane, Helena, MT 59601
2001      Linus    Morris  ...   79.6       81 Homestead Drive, Voorhees, NJ 08043

[1984 rows x 8 columns]

In [164]:
import numpy as np
df['newcol'] = np.nan

df.head()

     fname     lname  ...                                   address  newcol
0   Marcia      Pugh  ...   9253 Richardson Road, Matawan, NJ 07747     NaN
1   Kadeem  Morrison  ...          33 Spring Dr., Taunton, MA 02780     NaN
2     Nash    Powell  ...          41 Hill Avenue, Mentor, OH 44060     NaN
3  Noelani    Wagner  ...        8839 Marshall St., Miami, FL 33125     NaN
4  Noelani    Cherry  ...  8304 Charles Rd., Lewis Center, OH 43035     NaN

[5 rows x 9 columns]

In [165]:
df.dropna(axis=1, how='all')

          fname     lname  ...  grade                                      address
0        Marcia      Pugh  ...   82.4      9253 Richardson Road, Matawan, NJ 07747
1        Kadeem  Morrison  ...   78.2             33 Spring Dr., Taunton, MA 02780
2          Nash    Powell  ...   79.3             41 Hill Avenue, Mentor, OH 44060
3       Noelani    Wagner  ...   83.2           8839 Marshall St., Miami, FL 33125
4       Noelani    Cherry  ...   87.4     8304 Charles Rd., Lewis Center, OH 43035
...         ...       ...  ...    ...                                          ...
1997       Cody  Shepherd  ...   80.1        982 West Street, Alexandria, VA 22304
1998  Geraldine  Peterson  ...  100.0   78 Morris Street, East Northport, NY 11731
1999   Mercedes      Leon  ...   84.9        30 Glenridge Rd., Bountiful, UT 84010
2000     Lucius   Rowland  ...   69.1  342 West Meadowbrook Lane, Helena, MT 59601
2001      Linus    Morris  ...   79.6       81 Homestead Drive, Voorhees, NJ 08043

[2002 rows x 8 columns]

In [166]:
df.fillna(0)

          fname     lname  ...                                      address  newcol
0        Marcia      Pugh  ...      9253 Richardson Road, Matawan, NJ 07747     0.0
1        Kadeem  Morrison  ...             33 Spring Dr., Taunton, MA 02780     0.0
2          Nash    Powell  ...             41 Hill Avenue, Mentor, OH 44060     0.0
3       Noelani    Wagner  ...           8839 Marshall St., Miami, FL 33125     0.0
4       Noelani    Cherry  ...     8304 Charles Rd., Lewis Center, OH 43035     0.0
...         ...       ...  ...                                          ...     ...
1997       Cody  Shepherd  ...        982 West Street, Alexandria, VA 22304     0.0
1998  Geraldine  Peterson  ...   78 Morris Street, East Northport, NY 11731     0.0
1999   Mercedes      Leon  ...        30 Glenridge Rd., Bountiful, UT 84010     0.0
2000     Lucius   Rowland  ...  342 West Meadowbrook Lane, Helena, MT 59601     0.0
2001      Linus    Morris  ...       81 Homestead Drive, Voorhees, NJ 08043     0.0

[2002 rows x 9 columns]

In [167]:
df["grade"].fillna(df["grade"].mean(), inplace=True)
df['grade']

0        82.4
1        78.2
2        79.3
3        83.2
4        87.4
        ...
1997     80.1
1998    100.0
1999     84.9
2000     69.1
2001     79.6
Name: grade, Length: 2002, dtype: float64

In [168]:
df["grade"].fillna(df.groupby("gender")["grade"].transform("mean"), inplace=True)
df

          fname     lname  ...                                      address  newcol
0        Marcia      Pugh  ...      9253 Richardson Road, Matawan, NJ 07747     NaN
1        Kadeem  Morrison  ...             33 Spring Dr., Taunton, MA 02780     NaN
2          Nash    Powell  ...             41 Hill Avenue, Mentor, OH 44060     NaN
3       Noelani    Wagner  ...           8839 Marshall St., Miami, FL 33125     NaN
4       Noelani    Cherry  ...     8304 Charles Rd., Lewis Center, OH 43035     NaN
...         ...       ...  ...                                          ...     ...
1997       Cody  Shepherd  ...        982 West Street, Alexandria, VA 22304     NaN
1998  Geraldine  Peterson  ...   78 Morris Street, East Northport, NY 11731     NaN
1999   Mercedes      Leon  ...        30 Glenridge Rd., Bountiful, UT 84010     NaN
2000     Lucius   Rowland  ...  342 West Meadowbrook Lane, Helena, MT 59601     NaN
2001      Linus    Morris  ...       81 Homestead Drive, Voorhees, NJ 08043     NaN

[2002 rows x 9 columns]

In [169]:
df[df['age'].notnull() & df['gender'].notnull()]

          fname     lname  ...                                      address  newcol
0        Marcia      Pugh  ...      9253 Richardson Road, Matawan, NJ 07747     NaN
1        Kadeem  Morrison  ...             33 Spring Dr., Taunton, MA 02780     NaN
2          Nash    Powell  ...             41 Hill Avenue, Mentor, OH 44060     NaN
3       Noelani    Wagner  ...           8839 Marshall St., Miami, FL 33125     NaN
4       Noelani    Cherry  ...     8304 Charles Rd., Lewis Center, OH 43035     NaN
...         ...       ...  ...                                          ...     ...
1997       Cody  Shepherd  ...        982 West Street, Alexandria, VA 22304     NaN
1998  Geraldine  Peterson  ...   78 Morris Street, East Northport, NY 11731     NaN
1999   Mercedes      Leon  ...        30 Glenridge Rd., Bountiful, UT 84010     NaN
2000     Lucius   Rowland  ...  342 West Meadowbrook Lane, Helena, MT 59601     NaN
2001      Linus    Morris  ...       81 Homestead Drive, Voorhees, NJ 08043     NaN

[1993 rows x 9 columns]

# **Filtrado de datos**

In [170]:
import pandas as pd

names = ['Bob','Jessica','Mary','John','Mel']
grades = [76,-2,77,78,101]

GradeList = zip(names,grades)

df = pd.DataFrame(data = GradeList, columns=['Names', 'Grades'])
df

     Names  Grades
0      Bob      76
1  Jessica      -2
2     Mary      77
3     John      78
4      Mel     101

In [171]:
df.loc[df['Grades'] <= 100]

     Names  Grades
0      Bob      76
1  Jessica      -2
2     Mary      77
3     John      78

In [172]:
df

     Names  Grades
0      Bob      76
1  Jessica      -2
2     Mary      77
3     John      78
4      Mel     101

In [173]:
df.loc[(df['Grades'] >= 100,'Grades')] = 100
df

     Names  Grades
0      Bob      76
1  Jessica      -2
2     Mary      77
3     John      78
4      Mel     100

In [174]:
df.loc[(df['Grades'] < 0,'Grades')] = 0
df

     Names  Grades
0      Bob      76
1  Jessica       0
2     Mary      77
3     John      78
4      Mel     100

# **Buscando renglones duplicados**

In [175]:
import pandas as pd

names = ['Jan','John','Bob','Jan','Mary','John','Mel','Mel']
grades = [95,78,76,95,77,78,99,100]

GradeList = zip(names,grades)

df = pd.DataFrame(data = GradeList, columns=['Names', 'Grades'])
df

  Names  Grades
0   Jan      95
1  John      78
2   Bob      76
3   Jan      95
4  Mary      77
5  John      78
6   Mel      99
7   Mel     100

In [176]:
df.duplicated()

0    False
1    False
2    False
3     True
4    False
5     True
6    False
7    False
dtype: bool

In [177]:
df.drop_duplicates()

  Names  Grades
0   Jan      95
1  John      78
2   Bob      76
4  Mary      77
6   Mel      99
7   Mel     100

In [178]:
df.drop_duplicates(['Names'], keep='last')

  Names  Grades
2   Bob      76
3   Jan      95
4  Mary      77
5  John      78
7   Mel     100

**TAREA** Load the dataset datasets/dupedata.csv. We figure people with the same
address are duplicates. Can you drop the duplicated rows while keeping
the first?

In [179]:
import pandas as pd
Location = "/content/drive/My Drive/Colab Notebooks/datasets/dupedata.csv"
df = pd.read_csv(Location)

df.drop_duplicates(['address'], keep='first')

          fname     lname  ...  grade                                      address
0        Marcia      Pugh  ...   82.4      9253 Richardson Road, Matawan, NJ 07747
1        Kadeem  Morrison  ...   78.2             33 Spring Dr., Taunton, MA 02780
2          Nash    Powell  ...   79.3             41 Hill Avenue, Mentor, OH 44060
3       Noelani    Wagner  ...   83.2           8839 Marshall St., Miami, FL 33125
4       Noelani    Cherry  ...   87.4     8304 Charles Rd., Lewis Center, OH 43035
...         ...       ...  ...    ...                                          ...
2001       Cody  Shepherd  ...   80.1        982 West Street, Alexandria, VA 22304
2002  Geraldine  Peterson  ...  100.0   78 Morris Street, East Northport, NY 11731
2003   Mercedes      Leon  ...   84.9        30 Glenridge Rd., Bountiful, UT 84010
2004     Lucius   Rowland  ...   69.1  342 West Meadowbrook Lane, Helena, MT 59601
2005      Linus    Morris  ...   79.6       81 Homestead Drive, Voorhees, NJ 08043

[2000 rows x 8 columns]

# **Creación de nuevas variables**

In [189]:
import pandas as pd
Location = "/content/drive/My Drive/Colab Notebooks/datasets/gradedata.csv"

df = pd.read_csv(Location)
df.head()

     fname     lname  ... grade                                   address
0   Marcia      Pugh  ...  82.4   9253 Richardson Road, Matawan, NJ 07747
1   Kadeem  Morrison  ...  78.2          33 Spring Dr., Taunton, MA 02780
2     Nash    Powell  ...  79.3          41 Hill Avenue, Mentor, OH 44060
3  Noelani    Wagner  ...  83.2        8839 Marshall St., Miami, FL 33125
4  Noelani    Cherry  ...  87.4  8304 Charles Rd., Lewis Center, OH 43035

[5 rows x 8 columns]

In [191]:
# Create the bin dividers
bins = [0, 60, 70, 80, 90, 100]

# Create names for the four groups
group_names = ['F', 'D', 'C', 'B', 'A']

df['lettergrade'] = pd.cut(df['grade'], bins, labels=group_names)
df

          fname  ... lettergrade
0        Marcia  ...           B
1        Kadeem  ...           C
2          Nash  ...           C
3       Noelani  ...           B
4       Noelani  ...           B
...         ...  ...         ...
1995       Cody  ...           B
1996  Geraldine  ...           A
1997   Mercedes  ...           B
1998     Lucius  ...           D
1999      Linus  ...           C

[2000 rows x 9 columns]

In [193]:
pd.value_counts(df['lettergrade'])

B    737
C    580
A    475
D    193
F     15
Name: lettergrade, dtype: int64

In [183]:
pd.value_counts(df['gender'])

male      1000
female    1000
Name: gender, dtype: int64

In [184]:
pd.value_counts(df['age'])

17    356
18    349
19    345
16    334
14    316
15    300
Name: age, dtype: int64

**TAREA:** Recreate the dataframe from this section and create a column classifying
the row as pass or fail. This is for a master's program that requires a grade
of 80 or above for a student to pass.

In [188]:
Location = "/content/drive/My Drive/Colab Notebooks/datasets/gradedata.csv"

df = pd.read_csv(Location)

bins=[0, 80, 100]
group_names=['Fail', 'Pass']

df['Pass or Fail']= pd.cut(df['grade'], bins,labels=group_names)
df

          fname  ... Pass or Fail
0        Marcia  ...         Pass
1        Kadeem  ...         Fail
2          Nash  ...         Fail
3       Noelani  ...         Pass
4       Noelani  ...         Pass
...         ...  ...          ...
1995       Cody  ...         Pass
1996  Geraldine  ...         Pass
1997   Mercedes  ...         Pass
1998     Lucius  ...         Fail
1999      Linus  ...         Fail

[2000 rows x 9 columns]

# **Aplicando funciones a categorias, columnas y grupos**

In [194]:
df.groupby('lettergrade')['hours'].mean()

lettergrade
F     3.933333
D     5.544041
C     8.381034
B    11.827680
A    15.305263
Name: hours, dtype: float64

In [ ]:
df['grade']=df['grade'].apply(lambda x: int(x))

In [ ]:
df

In [ ]:
gender_preScore = df['grade'].groupby(df['gender'])
gender_preScore.mean()

**TAREA** Import the datasets/gradedata.csv file and create a new binned column
of the 'status' as either passing (> 70) or failing (<=70). Then, compute
the mean hours of exercise of the female students with a 'status' of
passing.

In [ ]:
import pandas as pd
Location = "/content/drive/My Drive/Colab Notebooks/datasets/gradedata.csv"
df = pd.read_csv(Location)
bins=[0,70,100]
groups_names=['falling','passing']
df['status'] = pd.cut(df['grade'], bins, labels = group_names)
df

# **Ranking de renglones de datos**

In [ ]:
import pandas as pd
Location = "/content/drive/My Drive/Colab Notebooks/datasets/gradedata.csv"
df = pd.read_csv(Location)
df.head()

In [ ]:
df['graderanked'] = df['grade'].rank(ascending=1)
df.tail()

In [ ]:
df.loc[(df['graderanked'] < 21) | (df['graderanked'] == 50)]

In [ ]:
df[df['graderanked'] < 6].sort_values('graderanked')

**Your Turn**
Can you find the 50 students with the most hours of study per week?

In [ ]:
df['Hours Ranked'] = df['hours'].rank(ascending=0)

df[df['Hours Ranked'] < 51].sort_values('Hours Ranked')

# **Crear una columna basada en un condicional**

In [ ]:
import pandas as pd
Location = "/content/drive/My Drive/Colab Notebooks/datasets/gradedata.csv"
df = pd.read_csv(Location)
df.head()

In [ ]:
import numpy as np
df['isFailing'] = np.where(df['grade']<70, 'yes', 'no')
df.tail(10)

In [ ]:
df['isFailingMale'] = np.where((df['grade']<70) & (df['gender'] == 'male'),'yes', 'no')
df.tail(10)

**Your Turn**
Can you create a column for timemgmt that shows busy if a student
exercises more than three hours per week AND studies more than
seventeen hours per week?

In [ ]:
df['timemgmt'] = np.where((df['exercise']>3 ) & (df['hours']> 17),'Busy', 'Free')
df.tail(10)

# **Creando nuevas columnas usando funciones**

In [ ]:
import pandas as pd
Location = "/content/drive/My Drive/Colab Notebooks/datasets/gradedata.csv"
df = pd.read_csv(Location)
df.head()

In [ ]:
def singlename(fn, ln):
  return fn + " " + ln

In [ ]:
df['fullname'] = singlename(df['fname'],df['lname'])
df

**Your Turn**
Can you create a column called total time that adds together the hours of
study per week and the hours of exercise per week?

In [ ]:
df['Total Time'] = df['exercise'] + df['hours']
df

# **Convirtiendo categorías String a Variables Numericas**

In [ ]:
import pandas as pd
Location = "/content/drive/My Drive/Colab Notebooks/datasets/gradedata.csv"
df = pd.read_csv(Location)
df.head()

In [ ]:
def score_to_numeric(x):
  if x=='female':
    return 1
  if x=='male':
    return 0

In [ ]:
df['gender_val'] = df['gender'].apply(score_to_numeric)
df.tail()

In [ ]:
df_gender = pd.get_dummies(df['gender'])
df_gender.tail()

In [ ]:
# Alterative for joining the new columns
df_new = df.join(df_gender)
df_new.tail()

**Your Turn**
Using datasets/gradesdatawithyear.csv, can you create a numeric
column to replace statuses of freshman through senior with the numerals 1
through 4?

In [ ]:
import pandas as pd
Location = "/content/drive/My Drive/Colab Notebooks/datasets/gradesdatawithyear.csv"
df = pd.read_csv(Location, header=None)
df.head()

def score_to_numeric(x):
  if x=='freshman':
    return 1
  if x=='sophomore':
    return 2
  if x=='junior':
    return 3
  if x=='senior':
    return 4

df['Status'] = df[8].apply(score_to_numeric)
df.tail()

# **ORGANIZANDO LOS DATOS**

# **Removiendo y agregando datos**

In [ ]:
import pandas as pd

names = ['Bob','Jessica','Mary','John','Mel']
grades = [76,95,77,78,99]
bsdegrees = [1,1,0,0,1]
msdegrees = [2,1,0,0,0]
phddegrees = [0,1,0,0,0]

GradeList = zip(names,grades,bsdegrees,msdegrees, phddegrees)
columns=['Names','Grades','BS','MS','PhD']
df = pd.DataFrame(data = GradeList, columns=columns)

df

In [ ]:
df.drop('PhD', axis=1)

In [ ]:
df['HighSchool']=0
df

In [ ]:
df['PreSchool'] = np.nan
df

In [ ]:
d = ([0,1,0,1,0])
s = pd.Series(d, index= df.index)
df['DriversLicense'] = s
df

**Your Turn**
Can you remove the bs, ms, and phd degree columns?
Can you add a Hogwarts Magic Degree column? Everyone but Jessica
has one; does that make it harder? No? Then I have to be sure to stump you
next time.

In [ ]:
h = ([0,1,0,1,0])
hs = pd.Series(h, index= df.index)
df['Hogwarts Magic Degree'] = hs
df.drop(['BS', 'MS', 'PhD'], axis=1)

# **Seleccionando columnas**

In [ ]:
import pandas as pd

Location = "/content/drive/My Drive/Colab Notebooks/datasets/gradedata.csv"
df = pd.read_csv(Location)

df.head()

In [ ]:
df['fname']

In [ ]:
df[['fname']]

In [ ]:
df[['fname','age','grade']]

In [ ]:
df2 = df[['fname','age','grade']]
df2.head()

**Your Turn**
We need to create a mailing list. Can you create a new dataframe by
selecting the first name, last name, and address fields?

In [ ]:
df3= df[['fname', 'lname', 'address']]
df3.head()

# **Cambiando el nombre a una columna**

In [ ]:
import pandas as pd

Location = "/content/drive/My Drive/Colab Notebooks/datasets/gradedata.csv"
df = pd.read_csv(Location)

df.head()

In [ ]:
df.columns = ['FirstName', 'LastName', 'Gender',
'Age', 'HoursExercisePerWeek',
'HoursStudyPerWeek', 'LetterGrade',
'StreetAddress']
df.head()

In [ ]:
headers = list(df.columns.values)

In [ ]:
headers[0] = 'FName'
headers[1] = 'LName'
df.columns = headers
df.head()

**Your Turn**
Can you change the age column name to years?

In [ ]:
headers[3]= 'Year'
df.columns= headers
df.head()
df.columns = [x.lower() for x in df.columns]
df

**Your Turn**
Can you figure out how to make all the column headers all uppercase?

In [ ]:
df.columns = [x.upper() for x in df.columns]
df

# **Buscando registros que cumplan condición**

In [ ]:
import pandas as pd
names = ['Bob','Jessica','Mary','John','Mel']
grades = [76,95,77,78,99]
GradeList = zip(names,grades)
df = pd.DataFrame(data = GradeList,
columns=['Names', 'Grades'])
df

In [ ]:
df['Names'].str.contains('Mel')

In [ ]:
df['Names'].str.contains('Mel').any()

In [ ]:
df['Names'].str.contains('Mel').all()

In [ ]:
# Find the rows that match a criteria like this
df.loc[df['Names'].str.contains('Mel')==True]

In [ ]:
# or even like this...
df.loc[df['Grades']==0]

**Your Turn**
Can you find all the people who have at least one MS degree in the
following data (Listing 3-72)?
Listing 3-72. Starting Dataset
import pandas as pd
names = ['Bob','Jessi','Mary','John','Mel','Sam',
'Cathy','Hank','Lloyd']
grades = [76,95,77,78,99,84,79,100,73]
bsdegrees = [1,1,0,0,1,1,1,0,1]
msdegrees = [2,1,0,0,0,1,1,0,0]
phddegrees = [0,1,0,0,0,2,1,0,0]
GradeList = zip(names,grades,bsdegrees,msdegrees,
phddegrees)
df = pd.DataFrame(data = GradeList, columns=['Name','Grade','BS',
'MS','PhD'])
df

In [ ]:
import pandas as pd
names = ['Bob','Jessi','Mary','John','Mel','Sam','Cathy','Hank','Lloyd']
grades = [76,95,77,78,99,84,79,100,73]
bsdegrees = [1,1,0,0,1,1,1,0,1]
msdegrees = [2,1,0,0,0,1,1,0,0]
phddegrees = [0,1,0,0,0,2,1,0,0]

GradeList = zip(names,grades,bsdegrees,msdegrees,phddegrees)

df = pd.DataFrame(data = GradeList, columns=['Name','Grade','BS',
'MS','PhD'])
df

# **Filtrar renglones en base a condiciones**

In [ ]:
import pandas as pd

Location = "/content/drive/My Drive/Colab Notebooks/datasets/gradedata.csv"
df = pd.read_csv(Location)

df.head()

In [ ]:
df['grade'].head()

In [ ]:
df[['age','grade']].head()

In [ ]:
df[:2]

In [ ]:
df[df['grade'] > 80]

In [ ]:
df[(df['grade'] > 99.9) & (df['gender'] == 'male') ]

In [ ]:
df[(df['grade'] > 99.9) & (df['gender'] == 'female') ]

**Your Turn**
Can you show all the rows where the student was male, exercised less than
two hours per week, and studied more than fifteen hours per week?

In [ ]:
df[(df['hours'] > 15) & (df['gender'] == 'male') & (df['exercise'] < 2) ]

# **Seleccionar renglones en base a condiciones**

In [ ]:
import pandas as pd

Location = "/content/drive/My Drive/Colab Notebooks/datasets/gradedata.csv"
df = pd.read_csv(Location)

df.head()

In [ ]:
female = df['gender'] == "female"
a_student = df['grade'] >= 90
df[female & a_student].head()

In [ ]:
df[df['fname'].notnull() & (df['gender'] == "male")]

**Your Turn**
Can you find all the rows where the student had four or more hours of
exercise per week, seventeen or more hours of study, and still had a grade
that was lower than 80?

In [ ]:
df[(df['hours'] > 15) & (df['gender'] == 'male') & (df['exercise'] < 2) ]

# **Muestreo aleatorio de un DataFrame**

In [ ]:
import pandas as pd
import numpy as np

Location = "/content/drive/My Drive/Colab Notebooks/datasets/gradedata.csv"
df = pd.read_csv(Location)

df.tail()

In [ ]:
df.take(np.random.permutation(len(df))[:100])

**Your Turn**
Can you create a random sample of 500 rows from that dataset?

In [ ]:
df.take(np.random.permutation(len(df))[:500])